Revit 2024 API
ParameterDownloadOptions Constructor
Overload List
Name | Description
ParameterDownloadOptions()
 Default constructor.
ParameterDownloadOptions(ISet<ElementId>, Boolean, Boolean, ForgeTypeId)
 Creates a new ParameterDownloadOptions instance. Category bindings are represented by an ElementIdSet populated with category identifiers.
See Also
ParameterDownloadOptions Class
ParameterDownloadOptions Members
Autodesk.Revit.DB Namespace